src/main/resources/xml/NewUserRegistration/NewUserRegistration_soap1_1-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="https://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="https://www.w3.org/2001/XMLSchema"
               xmlns:soap="https://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <NewUserRegistration xmlns="https://tempuri.org/">
            <documentNumber>string</documentNumber>
            <documentType>string</documentType>
            <programId>string</programId>
            <username>string</username>
            <password>string</password>
            <genderType>string</genderType>
            <mail>string</mail>
            <telephone>string</telephone>
            <prefix>string</prefix>
            <telephoneType>string</telephoneType>
            <web>string</web>
            <updateGenderOnCore>string</updateGenderOnCore>
        </NewUserRegistration>
    </soap:Body>
</soap:Envelope>

        <!--        HTTP/1.1 200 OK-->
        <!--        Content-Type: text/xml; charset=utf-8-->
        <!--        Content-Length: length-->

        <!--        POST /serviceconsulta.asmx HTTP/1.1-->
        <!--        Host: wscabalindividuosdev.cabal.coop-->
        <!--        Content-Type: text/xml; charset=utf-8-->
        <!--        Content-Length: length-->
        <!--        SOAPAction: "https://tempuri.org/NewUserRegistration"-->